# Introduction

Pandas is a Python Library for data analysis and manipulation.

In [1]:
#importing the libraries 

import numpy as np 
import pandas as pd

There are 2 data structures provided by Pandas: 
- Series
- Data Frame

Series: One-dimensional array like strcture capable of holding data types like int, float, strings

Let's create a series

In [ ]:
s = pd.Series([5, 8, 9, 'Hey', 8.9])

DataFrame: Two-dimensional tabular structure with labeled rows and cols.
Let's create a dataframe by passing a Numpy array

pandas.date_range(start=None, end=None, periods=None, freq=None, tz=None, 
normalize=False, name=None, closed=None, **kwargs)

Returns a fixed frequence DatetimeIndex

In [2]:
dates = pd.date_range('20190224', periods=5)

In [3]:
dates

DatetimeIndex(['2019-02-24', '2019-02-25', '2019-02-26', '2019-02-27',
               '2019-02-28'],
              dtype='datetime64[ns]', freq='D')

In [4]:
#We need to pass a list in index (row) and col
df = pd.DataFrame(np.random.randn(5, 3), index=dates, columns=['ab', 'ty', 'br'])

In [5]:
df

                  ab        ty        br
2019-02-24 -0.093948 -0.294150 -0.353227
2019-02-25  0.907949 -0.402653 -1.563576
2019-02-26  1.516694  0.719001 -1.163136
2019-02-27  0.447131 -0.942456  0.849135
2019-02-28  1.730706 -2.537608 -0.123929

In [6]:
#We can also pass a dictionary to create a dataframe 
mydict = {'A': np.arange(12, 15), 'B': ['Chocolate', 'Vanilla', 'Strawberry'], 
         'C': 6}
df2 = pd.DataFrame(mydict)

In [7]:
mydict

{'A': array([12, 13, 14]), 'B': ['Chocolate', 'Vanilla', 'Strawberry'], 'C': 6}

In [8]:
df2

    A           B  C
0  12   Chocolate  6
1  13     Vanilla  6
2  14  Strawberry  6

In [9]:
#To view the top 
df2.head()

    A           B  C
0  12   Chocolate  6
1  13     Vanilla  6
2  14  Strawberry  6

In [10]:
#To view the bottom
df2.tail()

    A           B  C
0  12   Chocolate  6
1  13     Vanilla  6
2  14  Strawberry  6

In [11]:
#To transpose
df2.T

           0        1           2
A         12       13          14
B  Chocolate  Vanilla  Strawberry
C          6        6           6

In [12]:
#To sort by axis
df.sort_index(axis=1, ascending = False)

                  ty        br        ab
2019-02-24 -0.294150 -0.353227 -0.093948
2019-02-25 -0.402653 -1.563576  0.907949
2019-02-26  0.719001 -1.163136  1.516694
2019-02-27 -0.942456  0.849135  0.447131
2019-02-28 -2.537608 -0.123929  1.730706

In [13]:
#To sort by value
df.sort_values(by = 'ty')

                  ab        ty        br
2019-02-28  1.730706 -2.537608 -0.123929
2019-02-27  0.447131 -0.942456  0.849135
2019-02-25  0.907949 -0.402653 -1.563576
2019-02-24 -0.093948 -0.294150 -0.353227
2019-02-26  1.516694  0.719001 -1.163136

In [14]:
#For a statistical summary 
df.describe()

             ab        ty        br
count  5.000000  5.000000  5.000000
mean   0.901706 -0.691573 -0.470947
std    0.752239  1.193935  0.942054
min   -0.093948 -2.537608 -1.563576
25%    0.447131 -0.942456 -1.163136
50%    0.907949 -0.402653 -0.353227
75%    1.516694 -0.294150 -0.123929
max    1.730706  0.719001  0.849135

In [15]:
#To select a single column
df['ty']

2019-02-24   -0.294150
2019-02-25   -0.402653
2019-02-26    0.719001
2019-02-27   -0.942456
2019-02-28   -2.537608
Freq: D, Name: ty, dtype: float64

In [16]:
#To select by slicing the rows
df[0:1]

                  ab       ty        br
2019-02-24 -0.093948 -0.29415 -0.353227

In [17]:
#To select by label
df.loc[dates[0]]

ab   -0.093948
ty   -0.294150
br   -0.353227
Name: 2019-02-24 00:00:00, dtype: float64

In [18]:
#To select by multiple axis
df.loc[:, ['ab', 'ty']]

                  ab        ty
2019-02-24 -0.093948 -0.294150
2019-02-25  0.907949 -0.402653
2019-02-26  1.516694  0.719001
2019-02-27  0.447131 -0.942456
2019-02-28  1.730706 -2.537608

In [19]:
#To select by position
df.iloc[2]

ab    1.516694
ty    0.719001
br   -1.163136
Name: 2019-02-26 00:00:00, dtype: float64

In [21]:
#To select by slices 
df.iloc[1:3, 0:2]

                  ab        ty
2019-02-25  0.907949 -0.402653
2019-02-26  1.516694  0.719001

## Dealing with Missing Data

- Missing data can be a cause of trouble during data analysis
- NaN is a special value in NumPy to represent missing data 
- Pandas uses np.nan to deal with them 

Let's get back to our dataframe 'df' and add another col 'lx'.

- Reindex allows to add/delete or change the index on a specified axis. 
- It places NaN in locations having no value in the previous index.

In [22]:
df1 = df.reindex(index=dates[0:3], columns = list(df.columns) + ['lx'])
df1.loc[dates[1], 'lx'] = 7

In [23]:
df1

                  ab        ty        br   lx
2019-02-24 -0.093948 -0.294150 -0.353227  NaN
2019-02-25  0.907949 -0.402653 -1.563576  7.0
2019-02-26  1.516694  0.719001 -1.163136  NaN

In the above steps we have added a col, deleted a row, and changed the value of 2nd row 4th col to '7'. The rest of the values of new col 'lx' set to NaN.

In [24]:
#To drop any rows that have missing data
df1.dropna(how='any')

                  ab        ty        br   lx
2019-02-25  0.907949 -0.402653 -1.563576  7.0

In [25]:
#To fill the missing data 
df1.fillna(value=5)

                  ab        ty        br   lx
2019-02-24 -0.093948 -0.294150 -0.353227  5.0
2019-02-25  0.907949 -0.402653 -1.563576  7.0
2019-02-26  1.516694  0.719001 -1.163136  5.0

In [26]:
#To get the boolean masking where values are NaN
pd.isna(df1)

               ab     ty     br     lx
2019-02-24  False  False  False   True
2019-02-25  False  False  False  False
2019-02-26  False  False  False   True

## Basic operations

In [32]:
#To get the mean
#axis can be passed as param
df.mean()

ab    0.901706
ty   -0.691573
br   -0.470947
dtype: float64

In [28]:
#To apply functions on dataframes
df.apply(np.cumsum)

                  ab        ty        br
2019-02-24 -0.093948 -0.294150 -0.353227
2019-02-25  0.814000 -0.696803 -1.916804
2019-02-26  2.330695  0.022198 -3.079940
2019-02-27  2.777826 -0.920258 -2.230805
2019-02-28  4.508532 -3.457865 -2.354734

In [29]:
df.apply(lambda x: x.max() - x.min())

ab    1.824654
ty    3.256609
br    2.412711
dtype: float64

String Methods like lower, upper, strip, split, replace, concatenate can be used on Series

In [37]:
s1 = pd.Series(['A', 'B', np.nan, 'kitKat', 'DOODLE'])

In [38]:
s1

0         A
1         B
2       NaN
3    kitKat
4    DOODLE
dtype: object

In [39]:
s1.str.lower()

0         a
1         b
2       NaN
3    kitkat
4    doodle
dtype: object

In [65]:
s2 = pd.Index(['  numpy', 'seaborn  ', 'keras'])

Index is an immutable ndarray

In [66]:
s2

Index(['  numpy', 'seaborn  ', 'keras'], dtype='object')

In [67]:
s2 = s2.str.strip()

In [68]:
s2

Index(['numpy', 'seaborn', 'keras'], dtype='object')

We can use the String Methods on Index for cleaning data frame. Let's have a dataframe df3 with cols with whitespace. We will apply some string methods on them.

In [48]:
df3 = pd.DataFrame(np.random.randn(2, 2), columns = ['  Col X', 'Col Y  '], index=range(2))

In [49]:
df3

      Col X   Col Y
0  0.234009 -0.234194
1  0.499695  0.398204

In [52]:
df3.columns = df3.columns.str.strip().str.lower().str.replace(' ', '-')

In [53]:
df3

      col-x     col-y
0  0.234009 -0.234194
1  0.499695  0.398204

In [69]:
#To concatenate
s2 = s2.str.cat(sep=',')

In [70]:
s2

'numpy,seaborn,keras'

We can merge/concatenate Series, DataFrames with various objects

In [91]:
parts = [df.iloc[0:2, 0:1], df.iloc[0:2, 1:2]]

In [103]:
pd.concat(parts, sort=True)

                  ab        ty
2019-02-24 -0.093948       NaN
2019-02-25  0.907949       NaN
2019-02-24       NaN -0.294150
2019-02-25       NaN -0.402653

To merge two dataframes by a common key value we can use merge function

In [111]:
x = pd.DataFrame({'Slot': ['Morning', 'Evening'], 'Sunday': ['Toast', 'Rice']})

In [112]:
x

      Slot Sunday
0  Morning  Toast
1  Evening   Rice

In [115]:
y = pd.DataFrame({'Slot': ['Morning', 'Evening'], 'Monday': ['Sandwich', 'Biryani']})

In [116]:
y

      Slot    Monday
0  Morning  Sandwich
1  Evening   Biryani

In [117]:
pd.merge(x, y, on='Slot')

      Slot Sunday    Monday
0  Morning  Toast  Sandwich
1  Evening   Rice   Biryani

We can append rows to a dataframe using data_frame.append(new_row, ignore_index=True)

In [2]:
#Grouping and applying functions
df4 = pd.DataFrame({'A':['a', 'b', 'a', 'b'], 'B':[1, 2, 3, 4], 'C':[-1,-2,-3,-4]})

In [3]:
df4

   A  B  C
0  a  1 -1
1  b  2 -2
2  a  3 -3
3  b  4 -4

In [6]:
df4.groupby('A').sum()

   B  C
A
a  4 -4
b  6 -6

## Reading and Writing to CSV and Excel files

In [ ]:
#Writing to CSV
df.to_csv('filename.csv')

#Reading from CSV
df.read_csv('filename.csv')

#Writing to Excel
df.to_excel('filename.xlsx', sheet_name='Sheet1')

#Reading to Excel
pd.read_excel('filename.xlsx', 'Sheet1', index_col=None, na_values=['NA'])